app/controllers/events_controller.rb

SELECT  "events".* FROM "events"  WHERE "events"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "events" SET "name" = ?, "starts_at" = ?, "updated_at" = ? WHERE "events"."id" = 1  [["name", "Updated Event Name"], ["starts_at", "2014-04-04 13:24:00.000000"], ["updated_at", "2014-03-25 13:24:13.348384"]]
---
  def update
    @event = Event.find(params[:id])
    if @event.update(event_params)

INSERT INTO "events" ("capacity", "created_at", "description", "image_file_name", "location", "name", "price", "starts_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @event = Event.new(event_params)
    if @event.save